api-testing/report/report_2025-12-30T03-32-24.txt
     â–ˆ AUTH

       âœ“ Login User And Get Token - status is 200
       âœ“ Login User And Get Token - body is not empty
       âœ— Login User And Get Token - time 464.7524
        â†³  0% â€” âœ“ 0 / âœ— 1
       âœ“ Login User And Get Token - username matches expected
       âœ“ Get Current Auth User - status is 200
       âœ“ Get Current Auth User - body is not empty
       âœ— Get Current Auth User - time 411.5278
        â†³  0% â€” âœ“ 0 / âœ— 1
       âœ“ Get Current Auth User - firstname matches expected
       âœ“ Get Current Auth User - lastname matches expected
       âœ“ Get Current Auth User - username matches expected
       âœ“ Refresh Auth Session - status is 200
       âœ“ Refresh Auth Session - body is not empty
       âœ— Refresh Auth Session - time 389.759
        â†³  0% â€” âœ“ 0 / âœ— 1
       âœ“ Refresh Auth Session - access_token is refreshed

     â–ˆ PRODUCT

       âœ“ Get a Single Product - status is 200
       âœ“ Get a Single Product - body is not empty
       âœ“ Get a Single Product - time 83.4241
       âœ— Add New Product - status is 200
        â†³  0% â€” âœ“ 0 / âœ— 1
       âœ“ Add New Product - body is not empty
       âœ— Add New Product - time 412.9032
        â†³  0% â€” âœ“ 0 / âœ— 1
       âœ“ Add New Product - new product is equal

     checks.........................: 76.19% âœ“ 16     âœ— 5
     data_received..................: 13 kB  6.2 kB/s
     data_sent......................: 3.4 kB 1.6 kB/s
     group_duration.................: avg=1.05s     min=510.3ms med=1.05s    max=1.6s     p(90)=1.49s     p(95)=1.54s    
     http_req_blocked...............: avg=61.25ms   min=0s      med=0s       max=306.25ms p(90)=183.75ms  p(95)=245ms    
     http_req_connecting............: avg=14.54ms   min=0s      med=0s       max=72.7ms   p(90)=43.62ms   p(95)=58.16ms  
     http_req_duration..............: avg=352.47ms  min=83.42ms med=411.52ms max=464.75ms p(90)=444.01ms  p(95)=454.38ms 
       { expected_response:true }...: avg=352.47ms  min=83.42ms med=411.52ms max=464.75ms p(90)=444.01ms  p(95)=454.38ms 
     http_req_failed................: 0.00%  âœ“ 0      âœ— 5
     http_req_receiving.............: avg=1.66ms    min=0s      med=0s       max=8.31ms   p(90)=4.98ms    p(95)=6.65ms   
     http_req_sending...............: avg=373.06Âµs min=0s      med=491.2Âµs max=838.5Âµs p(90)=717.34Âµs p(95)=777.92Âµs
     http_req_tls_handshaking.......: avg=32ms      min=0s      med=0s       max=160.01ms p(90)=96ms      p(95)=128.01ms 
     http_req_waiting...............: avg=350.43ms  min=83.42ms med=403.21ms max=463.91ms p(90)=443.29ms  p(95)=453.6ms  
     http_reqs......................: 5      2.364044/s
     iteration_duration.............: avg=2.11s     min=2.11s   med=2.11s    max=2.11s    p(90)=2.11s     p(95)=2.11s    
     iterations.....................: 1      0.472809/s
     vus............................: 1      min=1      max=1
     vus_max........................: 1      min=1      max=1